package com.plmm.common.base;

public enum ResultEnum {
	
	SUCCESS("111111","成功！"),

	MH000001("MH000001","用户或密码不正确"),
	MH000002("MH000002","参数不能为空"),
	MH000003("MH000003","当前组织下有未离职人员，请等人员离职后再操作"),
	MH000004("MH000004","新增失败"),
	MH000005("MH000005","名称重复"),
	MH000006("MH000006","原始密码错误，请修改后操作"),
	MH000007("MH000007","文件格式不正确"),
	MH000008("MH000008","文件过大"),
	MH000009("MH000009","文件保存失败"),
	MH000010("MH000010","修改失败"),


	BL000001("BL000001","起始日期和结束日期为必输项！"),
	BL000002("BL000002","当前菜单仅限数据管理岗、部门经理、销售主管操作！"),
	BL000003("BL000003","请选择至少一条记录！"),
	BL000004("BL000004","任务缺少必要条件！"),
	BL000005("BL000005","数据校验异常！"),
	BL000006("BL000006","补录任务已经存在!"),
	BL000007("BL000007","截止时间已超期，请修改截止时间!"),
	BL000008("BL000008","请完善补录人员!"),


	FX000001("FX000001","起始日期和结束日期为必输项！"),
	FX000002("FX000002","当前菜单仅限数据管理岗、部门经理、销售主管操作！"),
	FX000003("FX000003","请选择至少一条记录！"),
	FX000004("FX000004","任务缺少必要条件！"),
	FX000005("FX000005","数据校验异常！"),



	ZJ000001("ZJ000001","当前菜单仅限数据管理岗、销售主管操作！"),
	ZJ000002("ZJ000002","开始日期和结束日期为必输项！"),
    ZJ000004("ZJ000004","任务缺少必要条件！"),
    ZJ000005("ZJ000005","名称重复"),
    ZJ000007("ZJ000007","文件格式不正确"),
    ZJ000008("ZJ000008","文件过大"),
    ZJ000009("ZJ000009","文件保存失败"),
	

	ST000000("ST000000","通讯异常"),
	ST000001("ST000001","数据库异常"),
	ST999999("ST999999","未知异常,请联系管理员");
	
	private String returnCode;
	private String returnMsg;
	
	ResultEnum(String returnCode,String returnMsg){
		this.returnCode=returnCode;
		this.returnMsg=returnMsg;
	}
	
	public String getReturnCode() {
		return returnCode;
	}
	
	public String getReturnMsg() {
		return returnMsg;
	}
}

